MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0RGTB/mcu.h
/**
 * @brief PWC
 */
typedef struct {
    __IO uint32_t FCG0;
    __IO uint32_t FCG1;
    __IO uint32_t FCG2;
    __IO uint32_t FCG3;
    __IO uint32_t FCG0PC;
    uint8_t RESERVED0[17436];
    __IO uint8_t  VBATRSTR;
    uint8_t RESERVED1[15];
    __IO uint8_t  VBATCR;
    uint8_t RESERVED2[15];
    __IO uint8_t  WKTC0;
    uint8_t RESERVED3[3];
    __IO uint8_t  WKTC1;
    uint8_t RESERVED4[3];
    __IO uint8_t  WKTC2;
    uint8_t RESERVED5[423];
    __IO uint8_t  BKR0;
    uint8_t RESERVED6[3];
    __IO uint8_t  BKR1;
    uint8_t RESERVED7[3];
    __IO uint8_t  BKR2;
    uint8_t RESERVED8[3];
    __IO uint8_t  BKR3;
    uint8_t RESERVED9[3];
    __IO uint8_t  BKR4;
    uint8_t RESERVED10[3];
    __IO uint8_t  BKR5;
    uint8_t RESERVED11[3];
    __IO uint8_t  BKR6;
    uint8_t RESERVED12[3];
    __IO uint8_t  BKR7;
    uint8_t RESERVED13[3];
    __IO uint8_t  BKR8;
    uint8_t RESERVED14[3];
    __IO uint8_t  BKR9;
    uint8_t RESERVED15[3];
    __IO uint8_t  BKR10;
    uint8_t RESERVED16[3];
    __IO uint8_t  BKR11;
    uint8_t RESERVED17[3];
    __IO uint8_t  BKR12;
    uint8_t RESERVED18[3];
    __IO uint8_t  BKR13;
    uint8_t RESERVED19[3];
    __IO uint8_t  BKR14;
    uint8_t RESERVED20[3];
    __IO uint8_t  BKR15;
    uint8_t RESERVED21[3];
    __IO uint8_t  BKR16;
    uint8_t RESERVED22[3];
    __IO uint8_t  BKR17;
    uint8_t RESERVED23[3];
    __IO uint8_t  BKR18;
    uint8_t RESERVED24[3];
    __IO uint8_t  BKR19;
    uint8_t RESERVED25[3];
    __IO uint8_t  BKR20;
    uint8_t RESERVED26[3];
    __IO uint8_t  BKR21;
    uint8_t RESERVED27[3];
    __IO uint8_t  BKR22;
    uint8_t RESERVED28[3];
    __IO uint8_t  BKR23;
    uint8_t RESERVED29[3];
    __IO uint8_t  BKR24;
    uint8_t RESERVED30[3];
    __IO uint8_t  BKR25;
    uint8_t RESERVED31[3];
    __IO uint8_t  BKR26;
    uint8_t RESERVED32[3];
    __IO uint8_t  BKR27;
    uint8_t RESERVED33[3];
    __IO uint8_t  BKR28;
    uint8_t RESERVED34[3];
    __IO uint8_t  BKR29;
    uint8_t RESERVED35[3];
    __IO uint8_t  BKR30;
    uint8_t RESERVED36[3];
    __IO uint8_t  BKR31;
    uint8_t RESERVED37[3];
    __IO uint8_t  BKR32;
    uint8_t RESERVED38[3];
    __IO uint8_t  BKR33;
    uint8_t RESERVED39[3];
    __IO uint8_t  BKR34;
    uint8_t RESERVED40[3];
    __IO uint8_t  BKR35;
    uint8_t RESERVED41[3];
    __IO uint8_t  BKR36;
    uint8_t RESERVED42[3];
    __IO uint8_t  BKR37;
    uint8_t RESERVED43[3];
    __IO uint8_t  BKR38;
    uint8_t RESERVED44[3];
    __IO uint8_t  BKR39;
    uint8_t RESERVED45[3];
    __IO uint8_t  BKR40;
    uint8_t RESERVED46[3];
    __IO uint8_t  BKR41;
    uint8_t RESERVED47[3];
    __IO uint8_t  BKR42;
    uint8_t RESERVED48[3];
    __IO uint8_t  BKR43;
    uint8_t RESERVED49[3];
    __IO uint8_t  BKR44;
    uint8_t RESERVED50[3];
    __IO uint8_t  BKR45;
    uint8_t RESERVED51[3];
    __IO uint8_t  BKR46;
    uint8_t RESERVED52[3];
    __IO uint8_t  BKR47;
    uint8_t RESERVED53[3];
    __IO uint8_t  BKR48;
    uint8_t RESERVED54[3];
    __IO uint8_t  BKR49;
    uint8_t RESERVED55[3];
    __IO uint8_t  BKR50;
    uint8_t RESERVED56[3];
    __IO uint8_t  BKR51;
    uint8_t RESERVED57[3];
    __IO uint8_t  BKR52;
    uint8_t RESERVED58[3];
    __IO uint8_t  BKR53;
    uint8_t RESERVED59[3];
    __IO uint8_t  BKR54;
    uint8_t RESERVED60[3];
    __IO uint8_t  BKR55;
    uint8_t RESERVED61[3];
    __IO uint8_t  BKR56;
    uint8_t RESERVED62[3];
    __IO uint8_t  BKR57;
    uint8_t RESERVED63[3];
    __IO uint8_t  BKR58;
    uint8_t RESERVED64[3];
    __IO uint8_t  BKR59;
    uint8_t RESERVED65[3];
    __IO uint8_t  BKR60;
    uint8_t RESERVED66[3];
    __IO uint8_t  BKR61;
    uint8_t RESERVED67[3];
    __IO uint8_t  BKR62;
    uint8_t RESERVED68[3];
    __IO uint8_t  BKR63;
    uint8_t RESERVED69[3];
    __IO uint8_t  BKR64;
    uint8_t RESERVED70[3];
    __IO uint8_t  BKR65;
    uint8_t RESERVED71[3];
    __IO uint8_t  BKR66;
    uint8_t RESERVED72[3];
    __IO uint8_t  BKR67;
    uint8_t RESERVED73[3];
    __IO uint8_t  BKR68;
    uint8_t RESERVED74[3];
    __IO uint8_t  BKR69;
    uint8_t RESERVED75[3];
    __IO uint8_t  BKR70;
    uint8_t RESERVED76[3];
    __IO uint8_t  BKR71;
    uint8_t RESERVED77[3];
    __IO uint8_t  BKR72;
    uint8_t RESERVED78[3];
    __IO uint8_t  BKR73;
    uint8_t RESERVED79[3];
    __IO uint8_t  BKR74;
    uint8_t RESERVED80[3];
    __IO uint8_t  BKR75;
    uint8_t RESERVED81[3];
    __IO uint8_t  BKR76;
    uint8_t RESERVED82[3];
    __IO uint8_t  BKR77;
    uint8_t RESERVED83[3];
    __IO uint8_t  BKR78;
    uint8_t RESERVED84[3];
    __IO uint8_t  BKR79;
    uint8_t RESERVED85[3];
    __IO uint8_t  BKR80;
    uint8_t RESERVED86[3];
    __IO uint8_t  BKR81;
    uint8_t RESERVED87[3];
    __IO uint8_t  BKR82;
    uint8_t RESERVED88[3];
    __IO uint8_t  BKR83;
    uint8_t RESERVED89[3];
    __IO uint8_t  BKR84;
    uint8_t RESERVED90[3];
    __IO uint8_t  BKR85;
    uint8_t RESERVED91[3];
    __IO uint8_t  BKR86;
    uint8_t RESERVED92[3];
    __IO uint8_t  BKR87;
    uint8_t RESERVED93[3];
    __IO uint8_t  BKR88;
    uint8_t RESERVED94[3];
    __IO uint8_t  BKR89;
    uint8_t RESERVED95[3];
    __IO uint8_t  BKR90;
    uint8_t RESERVED96[3];
    __IO uint8_t  BKR91;
    uint8_t RESERVED97[3];
    __IO uint8_t  BKR92;
    uint8_t RESERVED98[3];
    __IO uint8_t  BKR93;
    uint8_t RESERVED99[3];
    __IO uint8_t  BKR94;
    uint8_t RESERVED100[3];
    __IO uint8_t  BKR95;
    uint8_t RESERVED101[3];
    __IO uint8_t  BKR96;
    uint8_t RESERVED102[3];
    __IO uint8_t  BKR97;
    uint8_t RESERVED103[3];
    __IO uint8_t  BKR98;
    uint8_t RESERVED104[3];
    __IO uint8_t  BKR99;
    uint8_t RESERVED105[3];
    __IO uint8_t  BKR100;
    uint8_t RESERVED106[3];
    __IO uint8_t  BKR101;
    uint8_t RESERVED107[3];
    __IO uint8_t  BKR102;
    uint8_t RESERVED108[3];
    __IO uint8_t  BKR103;
    uint8_t RESERVED109[3];
    __IO uint8_t  BKR104;
    uint8_t RESERVED110[3];
    __IO uint8_t  BKR105;
    uint8_t RESERVED111[3];
    __IO uint8_t  BKR106;
    uint8_t RESERVED112[3];
    __IO uint8_t  BKR107;
    uint8_t RESERVED113[3];
    __IO uint8_t  BKR108;
    uint8_t RESERVED114[3];
    __IO uint8_t  BKR109;
    uint8_t RESERVED115[3];
    __IO uint8_t  BKR110;
    uint8_t RESERVED116[3];
    __IO uint8_t  BKR111;
    uint8_t RESERVED117[3];
    __IO uint8_t  BKR112;
    uint8_t RESERVED118[3];
    __IO uint8_t  BKR113;
    uint8_t RESERVED119[3];
    __IO uint8_t  BKR114;
    uint8_t RESERVED120[3];
    __IO uint8_t  BKR115;
    uint8_t RESERVED121[3];
    __IO uint8_t  BKR116;
    uint8_t RESERVED122[3];
    __IO uint8_t  BKR117;
    uint8_t RESERVED123[3];
    __IO uint8_t  BKR118;
    uint8_t RESERVED124[3];
    __IO uint8_t  BKR119;
    uint8_t RESERVED125[3];
    __IO uint8_t  BKR120;
    uint8_t RESERVED126[3];
    __IO uint8_t  BKR121;
    uint8_t RESERVED127[3];
    __IO uint8_t  BKR122;
    uint8_t RESERVED128[3];
    __IO uint8_t  BKR123;
    uint8_t RESERVED129[3];
    __IO uint8_t  BKR124;
    uint8_t RESERVED130[3];
    __IO uint8_t  BKR125;
    uint8_t RESERVED131[3];
    __IO uint8_t  BKR126;
    uint8_t RESERVED132[3];
    __IO uint8_t  BKR127;
    uint8_t RESERVED133[1027];
    __IO uint8_t  PWRC0;
    uint8_t RESERVED134[3];
    __IO uint8_t  PWRC1;
    uint8_t RESERVED135[3];
    __IO uint8_t  PWRC2;
    uint8_t RESERVED136[3];
    __IO uint8_t  PWRC3;
    uint8_t RESERVED137[3];
    __IO uint8_t  PWRC4;
    uint8_t RESERVED138[3];
    __IO uint8_t  PVDCR0;
    uint8_t RESERVED139[3];
    __IO uint8_t  PVDCR1;
    uint8_t RESERVED140[3];
    __IO uint8_t  PVDFCR;
    uint8_t RESERVED141[3];
    __IO uint8_t  PVDLCR;
    uint8_t RESERVED142[7];
    __IO uint8_t  PDWKE0;
    uint8_t RESERVED143[3];
    __IO uint8_t  PDWKE1;
    uint8_t RESERVED144[3];
    __IO uint8_t  PDWKE2;
    uint8_t RESERVED145[3];
    __IO uint8_t  PDWKES;
    uint8_t RESERVED146[3];
    __IO uint8_t  PDWKF0;
    uint8_t RESERVED147[3];
    __IO uint8_t  PDWKF1;
    uint8_t RESERVED148[163];
    __IO uint32_t RAMPC0;
    __IO uint16_t RAMOPM;
    uint8_t RESERVED149[2];
    __IO uint32_t PRAMLPC;
    uint8_t RESERVED150[4];
    __IO uint8_t  PVDICR;
    uint8_t RESERVED151[3];
    __IO uint8_t  PVDDSR;
    uint8_t RESERVED152[29463];
    __IO uint16_t STPMCR;
    uint8_t RESERVED153[1008];
    __IO uint16_t FPRC;
} CM_PWC_TypeDef;

/**
 * @brief QSPI
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t CSCR;
    __IO uint32_t FCR;
    __IO uint32_t SR;
    __IO uint32_t DCOM;
    __IO uint32_t CCMD;
    __IO uint32_t XCMD;
    uint8_t RESERVED0[8];
    __O  uint32_t SR2;
    uint8_t RESERVED1[2012];
    __IO uint32_t EXAR;
} CM_QSPI_TypeDef;

/**
 * @brief RMU
 */
typedef struct {
    uint8_t RESERVED0[248];
    __IO uint8_t  PRSTCR0;
    uint8_t RESERVED1[3];
    __IO uint32_t RSTF0;
} CM_RMU_TypeDef;

/**
 * @brief RTC
 */
typedef struct {
    __IO uint8_t  CR0;
    uint8_t RESERVED0[3];
    __IO uint8_t  CR1;
    uint8_t RESERVED1[3];
    __IO uint8_t  CR2;
    uint8_t RESERVED2[3];
    __IO uint8_t  CR3;
    uint8_t RESERVED3[3];
    __IO uint8_t  SEC;
    uint8_t RESERVED4[3];
    __IO uint8_t  MIN;
    uint8_t RESERVED5[3];
    __IO uint8_t  HOUR;
    uint8_t RESERVED6[3];
    __IO uint8_t  WEEK;
    uint8_t RESERVED7[3];
    __IO uint8_t  DAY;
    uint8_t RESERVED8[3];
    __IO uint8_t  MON;
    uint8_t RESERVED9[3];
    __IO uint8_t  YEAR;
    uint8_t RESERVED10[3];
    __IO uint8_t  ALMMIN;
    uint8_t RESERVED11[3];
    __IO uint8_t  ALMHOUR;
    uint8_t RESERVED12[3];
    __IO uint8_t  ALMWEEK;
    uint8_t RESERVED13[3];
    __IO uint8_t  ERRCRH;
    uint8_t RESERVED14[3];
    __IO uint8_t  ERRCRL;
    uint8_t RESERVED15[3];
    __IO uint8_t  TPCR0;
    uint8_t RESERVED16[3];
    __IO uint8_t  TPCR1;
    uint8_t RESERVED17[3];
    __IO uint8_t  TPSR;
    uint8_t RESERVED18[3];
    __IO uint8_t  SECTP;
    uint8_t RESERVED19[3];
    __IO uint8_t  MINTP;
    uint8_t RESERVED20[3];
    __IO uint8_t  HOURTP;
    uint8_t RESERVED21[3];
    __IO uint8_t  DAYTP;
    uint8_t RESERVED22[3];
    __IO uint8_t  MONTP;
} CM_RTC_TypeDef;

/**
 * @brief SDIOC
 */
typedef struct {
    uint8_t RESERVED0[4];
    __IO uint16_t BLKSIZE;
    __IO uint16_t BLKCNT;
    __IO uint16_t ARG0;
    __IO uint16_t ARG1;
    __IO uint16_t TRANSMODE;
    __IO uint16_t CMD;
    __I  uint16_t RESP0;
    __I  uint16_t RESP1;
    __I  uint16_t RESP2;
    __I  uint16_t RESP3;
    __I  uint16_t RESP4;
    __I  uint16_t RESP5;
    __I  uint16_t RESP6;
    __I  uint16_t RESP7;
    __IO uint16_t BUF0;
    __IO uint16_t BUF1;
    __I  uint32_t PSTAT;
    __IO uint8_t  HOSTCON;
    __IO uint8_t  PWRCON;
    __IO uint8_t  BLKGPCON;
    uint8_t RESERVED1[1];
    __IO uint16_t CLKCON;
    __IO uint8_t  TOUTCON;
    __IO uint8_t  SFTRST;
    __IO uint16_t NORINTST;
    __IO uint16_t ERRINTST;
    __IO uint16_t NORINTSTEN;
    __IO uint16_t ERRINTSTEN;
    __IO uint16_t NORINTSGEN;
    __IO uint16_t ERRINTSGEN;
    __I  uint16_t ATCERRST;
    uint8_t RESERVED2[18];
    __O  uint16_t FEA;
    __O  uint16_t FEE;
} CM_SDIOC_TypeDef;

/**
 * @brief SMC
 */
typedef struct {
    __I  uint32_t STSR;
    uint8_t RESERVED0[4];
    __O  uint32_t STCR0;
    __O  uint32_t STCR1;
    __O  uint32_t CMDR;
    __O  uint32_t TMCR;
    __O  uint32_t CPCR;
    uint8_t RESERVED1[4];
    __IO uint32_t RFTR;
    uint8_t RESERVED2[220];
    __I  uint32_t TMSR0;
    __I  uint32_t CPSR0;
    uint8_t RESERVED3[24];
    __I  uint32_t TMSR1;
    __I  uint32_t CPSR1;
    uint8_t RESERVED4[24];
    __I  uint32_t TMSR2;
    __I  uint32_t CPSR2;
    uint8_t RESERVED5[24];
    __I  uint32_t TMSR3;
    __I  uint32_t CPSR3;
    uint8_t RESERVED6[152];
    __IO uint32_t BACR;
    uint8_t RESERVED7[4];
    __IO uint32_t CSCR0;
    __IO uint32_t CSCR1;
} CM_SMC_TypeDef;

/**
 * @brief SPI
 */
typedef struct {
    __IO uint32_t DR;
    __IO uint32_t CR1;
    uint8_t RESERVED0[4];
    __IO uint32_t CFG1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __IO uint32_t CFG2;
} CM_SPI_TypeDef;

/**
 * @brief SRAMC
 */
typedef struct {
    __IO uint32_t WTCR;
    __IO uint32_t WTPR;
    __IO uint32_t CKCR;
    __IO uint32_t CKPR;
    __IO uint32_t CKSR;
} CM_SRAMC_TypeDef;

/**
 * @brief SWDT
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} CM_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct {
    __IO uint32_t CNTAR;
    __IO uint32_t CNTBR;
    __IO uint32_t CMPAR;
    __IO uint32_t CMPBR;
    __IO uint32_t BCONR;
    __IO uint32_t STFLR;
} CM_TMR0_TypeDef;

/**
 * @brief TMR2
 */
typedef struct {
    __IO uint32_t CNTAR;
    __IO uint32_t CNTBR;
    __IO uint32_t CMPAR;
    __IO uint32_t CMPBR;
    __IO uint32_t BCONR;
    __IO uint32_t ICONR;
    __IO uint32_t PCONR;
    __IO uint32_t HCONR;
    __IO uint32_t STFLR;
} CM_TMR2_TypeDef;

/**
 * @brief TMR4
 */
typedef struct {
    uint8_t RESERVED0[2];
    __IO uint16_t OCCRUH;
    uint8_t RESERVED1[2];
    __IO uint16_t OCCRUL;
    uint8_t RESERVED2[2];
    __IO uint16_t OCCRVH;
    uint8_t RESERVED3[2];
    __IO uint16_t OCCRVL;
    uint8_t RESERVED4[2];
    __IO uint16_t OCCRWH;
    uint8_t RESERVED5[2];
    __IO uint16_t OCCRWL;
    __IO uint16_t OCSRU;
    __IO uint16_t OCERU;
    __IO uint16_t OCSRV;
    __IO uint16_t OCERV;
    __IO uint16_t OCSRW;
    __IO uint16_t OCERW;
    __IO uint16_t OCMRHUH;
    uint8_t RESERVED6[2];
    __IO uint32_t OCMRLUL;
    __IO uint16_t OCMRHVH;
    uint8_t RESERVED7[2];
    __IO uint32_t OCMRLVL;
    __IO uint16_t OCMRHWH;
    uint8_t RESERVED8[2];
    __IO uint32_t OCMRLWL;
    uint8_t RESERVED9[6];
    __IO uint16_t CPSR;
    uint8_t RESERVED10[2];
    __IO uint16_t CNTR;
    __IO uint16_t CCSR;
    __IO uint16_t CVPR;
    uint8_t RESERVED11[54];
    __IO uint16_t PFSRU;
    __IO uint16_t PDARU;
    __IO uint16_t PDBRU;
    uint8_t RESERVED12[2];
    __IO uint16_t PFSRV;
    __IO uint16_t PDARV;
    __IO uint16_t PDBRV;
    uint8_t RESERVED13[2];
    __IO uint16_t PFSRW;
    __IO uint16_t PDARW;
    __IO uint16_t PDBRW;
    __IO uint16_t POCRU;
    uint8_t RESERVED14[2];
    __IO uint16_t POCRV;
    uint8_t RESERVED15[2];
    __IO uint16_t POCRW;
    uint8_t RESERVED16[2];
    __IO uint16_t RCSR;
    uint8_t RESERVED17[12];
    __IO uint16_t SCCRUH;
    uint8_t RESERVED18[2];
    __IO uint16_t SCCRUL;
    uint8_t RESERVED19[2];
    __IO uint16_t SCCRVH;
    uint8_t RESERVED20[2];
    __IO uint16_t SCCRVL;
    uint8_t RESERVED21[2];
    __IO uint16_t SCCRWH;
    uint8_t RESERVED22[2];
    __IO uint16_t SCCRWL;
    __IO uint16_t SCSRUH;
    __IO uint16_t SCMRUH;
    __IO uint16_t SCSRUL;
    __IO uint16_t SCMRUL;
    __IO uint16_t SCSRVH;
    __IO uint16_t SCMRVH;
    __IO uint16_t SCSRVL;
    __IO uint16_t SCMRVL;
    __IO uint16_t SCSRWH;
    __IO uint16_t SCMRWH;
    __IO uint16_t SCSRWL;
    __IO uint16_t SCMRWL;
    __IO uint32_t PSCR;
    __IO uint16_t SCER;
} CM_TMR4_TypeDef;

/**
 * @brief TMR6
 */
typedef struct {
    __IO uint32_t CNTER;
    __IO uint32_t UPDAR;
    uint8_t RESERVED0[56];
    __IO uint32_t PERAR;
    __IO uint32_t PERBR;
    __IO uint32_t PERCR;
    uint8_t RESERVED1[52];
    __IO uint32_t GCMAR;
    __IO uint32_t GCMBR;
    __IO uint32_t GCMCR;
    __IO uint32_t GCMDR;
    __IO uint32_t GCMER;
    __IO uint32_t GCMFR;
    uint8_t RESERVED2[40];
    __IO uint32_t SCMAR;
    __IO uint32_t SCMBR;
    __IO uint32_t SCMCR;
    __IO uint32_t SCMDR;
    __IO uint32_t SCMER;
    __IO uint32_t SCMFR;
    uint8_t RESERVED3[40];
    __IO uint32_t DTUAR;
    __IO uint32_t DTDAR;
    __IO uint32_t DTUBR;
    __IO uint32_t DTDBR;
    uint8_t RESERVED4[48];
    __IO uint32_t GCONR;
    __IO uint32_t ICONR;
    __IO uint32_t BCONR;
    __IO uint32_t DCONR;
    uint8_t RESERVED5[4];
    __IO uint32_t PCNAR;
    __IO uint32_t PCNBR;
    __IO uint32_t FCNGR;
    __IO uint32_t VPERR;
    __IO uint32_t STFLR;
    uint8_t RESERVED6[24];
    __IO uint32_t HSTAR;
    __IO uint32_t HSTPR;
    __IO uint32_t HCLRR;
    __IO uint32_t HUPDR;
    __IO uint32_t HCPAR;
    __IO uint32_t HCPBR;
    __IO uint32_t HCUPR;
    __IO uint32_t HCDOR;
} CM_TMR6_TypeDef;

/**
 * @brief TMR6CR
 */
typedef struct {
    uint8_t RESERVED0[1004];
    __IO uint32_t FCNTR;
    __IO uint32_t SSTAR;
    __IO uint32_t SSTPR;
    __IO uint32_t SCLRR;
    __IO uint32_t SUPDR;
} CM_TMR6CR_TypeDef;

/**
 * @brief TMRA
 */
typedef struct {
    __IO uint16_t CNTER;
    uint8_t RESERVED0[2];
    __IO uint16_t PERAR;
    uint8_t RESERVED1[58];
    __IO uint16_t CMPAR1;
    uint8_t RESERVED2[2];
    __IO uint16_t CMPAR2;
    uint8_t RESERVED3[2];
    __IO uint16_t CMPAR3;
    uint8_t RESERVED4[2];
    __IO uint16_t CMPAR4;
    uint8_t RESERVED5[50];
    __IO uint8_t  BCSTRL;
    __IO uint8_t  BCSTRH;
    uint8_t RESERVED6[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED7[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED8[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED9[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED10[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED11[2];
    __IO uint16_t FCONR;
    uint8_t RESERVED12[2];
    __IO uint16_t STFLR;
    uint8_t RESERVED13[34];
    __IO uint16_t BCONR1;
    uint8_t RESERVED14[6];
    __IO uint16_t BCONR2;
    uint8_t RESERVED15[54];
    __IO uint16_t CCONR1;
    uint8_t RESERVED16[2];
    __IO uint16_t CCONR2;
    uint8_t RESERVED17[2];
    __IO uint16_t CCONR3;
    uint8_t RESERVED18[2];
    __IO uint16_t CCONR4;
    uint8_t RESERVED19[50];
    __IO uint16_t PCONR1;
    uint8_t RESERVED20[2];
    __IO uint16_t PCONR2;
    uint8_t RESERVED21[2];
    __IO uint16_t PCONR3;
    uint8_t RESERVED22[2];
    __IO uint16_t PCONR4;
} CM_TMRA_TypeDef;

/**
 * @brief TRNG
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t MR;
    uint8_t RESERVED0[4];
    __I  uint32_t DR0;
    __I  uint32_t DR1;
} CM_TRNG_TypeDef;

/**
 * @brief USART
 */
typedef struct {
    __I  uint32_t SR;
    __IO uint16_t TDR;
    __I  uint16_t RDR;
    __IO uint32_t BRR;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t PR;
    __I  uint32_t LBMC;
} CM_USART_TypeDef;

