MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0RGTB/mcu.h
/*  Bit definition for ETH_MAC_SMIDATR register  */
#define ETH_MAC_SMIDATR_SMID                           (0x0000FFFFUL)

/*  Bit definition for ETH_MAC_FLOCTLR register  */
#define ETH_MAC_FLOCTLR_FCA_BPA_POS                    (0U)
#define ETH_MAC_FLOCTLR_FCA_BPA                        (0x00000001UL)
#define ETH_MAC_FLOCTLR_TFE_POS                        (1U)
#define ETH_MAC_FLOCTLR_TFE                            (0x00000002UL)
#define ETH_MAC_FLOCTLR_RFE_POS                        (2U)
#define ETH_MAC_FLOCTLR_RFE                            (0x00000004UL)
#define ETH_MAC_FLOCTLR_UNP_POS                        (3U)
#define ETH_MAC_FLOCTLR_UNP                            (0x00000008UL)
#define ETH_MAC_FLOCTLR_PLT_POS                        (4U)
#define ETH_MAC_FLOCTLR_PLT                            (0x00000030UL)
#define ETH_MAC_FLOCTLR_PLT_0                          (0x00000010UL)
#define ETH_MAC_FLOCTLR_PLT_1                          (0x00000020UL)
#define ETH_MAC_FLOCTLR_DZPQ_POS                       (7U)
#define ETH_MAC_FLOCTLR_DZPQ                           (0x00000080UL)
#define ETH_MAC_FLOCTLR_PAUSET_POS                     (16U)
#define ETH_MAC_FLOCTLR_PAUSET                         (0xFFFF0000UL)

/*  Bit definition for ETH_MAC_VTAFLTR register  */
#define ETH_MAC_VTAFLTR_VLFLT_POS                      (0U)
#define ETH_MAC_VTAFLTR_VLFLT                          (0x0000FFFFUL)
#define ETH_MAC_VTAFLTR_VTAL_POS                       (16U)
#define ETH_MAC_VTAFLTR_VTAL                           (0x00010000UL)
#define ETH_MAC_VTAFLTR_VTIM_POS                       (17U)
#define ETH_MAC_VTAFLTR_VTIM                           (0x00020000UL)
#define ETH_MAC_VTAFLTR_VTHM_POS                       (19U)
#define ETH_MAC_VTAFLTR_VTHM                           (0x00080000UL)

/*  Bit definition for ETH_MAC_MACSTSR register  */
#define ETH_MAC_MACSTSR_MREA_POS                       (0U)
#define ETH_MAC_MACSTSR_MREA                           (0x00000001UL)
#define ETH_MAC_MACSTSR_MRS_POS                        (1U)
#define ETH_MAC_MACSTSR_MRS                            (0x00000006UL)
#define ETH_MAC_MACSTSR_MRS_0                          (0x00000002UL)
#define ETH_MAC_MACSTSR_MRS_1                          (0x00000004UL)
#define ETH_MAC_MACSTSR_RFWA_POS                       (4U)
#define ETH_MAC_MACSTSR_RFWA                           (0x00000010UL)
#define ETH_MAC_MACSTSR_RFRS_POS                       (5U)
#define ETH_MAC_MACSTSR_RFRS                           (0x00000060UL)
#define ETH_MAC_MACSTSR_RFRS_0                         (0x00000020UL)
#define ETH_MAC_MACSTSR_RFRS_1                         (0x00000040UL)
#define ETH_MAC_MACSTSR_RFFL_POS                       (8U)
#define ETH_MAC_MACSTSR_RFFL                           (0x00000300UL)
#define ETH_MAC_MACSTSR_RFFL_0                         (0x00000100UL)
#define ETH_MAC_MACSTSR_RFFL_1                         (0x00000200UL)
#define ETH_MAC_MACSTSR_MTEA_POS                       (16U)
#define ETH_MAC_MACSTSR_MTEA                           (0x00010000UL)
#define ETH_MAC_MACSTSR_MTS_POS                        (17U)
#define ETH_MAC_MACSTSR_MTS                            (0x00060000UL)
#define ETH_MAC_MACSTSR_MTS_0                          (0x00020000UL)
#define ETH_MAC_MACSTSR_MTS_1                          (0x00040000UL)
#define ETH_MAC_MACSTSR_MTP_POS                        (19U)
#define ETH_MAC_MACSTSR_MTP                            (0x00080000UL)
#define ETH_MAC_MACSTSR_TFRS_POS                       (20U)
#define ETH_MAC_MACSTSR_TFRS                           (0x00300000UL)
#define ETH_MAC_MACSTSR_TFRS_0                         (0x00100000UL)
#define ETH_MAC_MACSTSR_TFRS_1                         (0x00200000UL)
#define ETH_MAC_MACSTSR_TFWA_POS                       (22U)
#define ETH_MAC_MACSTSR_TFWA                           (0x00400000UL)
#define ETH_MAC_MACSTSR_TFNE_POS                       (24U)
#define ETH_MAC_MACSTSR_TFNE                           (0x01000000UL)
#define ETH_MAC_MACSTSR_TFF_POS                        (25U)
#define ETH_MAC_MACSTSR_TFF                            (0x02000000UL)

/*  Bit definition for ETH_MAC_RTWKFFR register  */
#define ETH_MAC_RTWKFFR_WKUPFRMFT                      (0xFFFFFFFFUL)

/*  Bit definition for ETH_MAC_PMTCTLR register  */
#define ETH_MAC_PMTCTLR_PWDN_POS                       (0U)
#define ETH_MAC_PMTCTLR_PWDN                           (0x00000001UL)
#define ETH_MAC_PMTCTLR_MPEN_POS                       (1U)
#define ETH_MAC_PMTCTLR_MPEN                           (0x00000002UL)
#define ETH_MAC_PMTCTLR_WKEN_POS                       (2U)
#define ETH_MAC_PMTCTLR_WKEN                           (0x00000004UL)
#define ETH_MAC_PMTCTLR_MPFR_POS                       (5U)
#define ETH_MAC_PMTCTLR_MPFR                           (0x00000020UL)
#define ETH_MAC_PMTCTLR_WKFR_POS                       (6U)
#define ETH_MAC_PMTCTLR_WKFR                           (0x00000040UL)
#define ETH_MAC_PMTCTLR_GLUB_POS                       (9U)
#define ETH_MAC_PMTCTLR_GLUB                           (0x00000200UL)
#define ETH_MAC_PMTCTLR_RTWKTR_POS                     (10U)
#define ETH_MAC_PMTCTLR_RTWKTR                         (0x00000400UL)
#define ETH_MAC_PMTCTLR_RTWKPT_POS                     (24U)
#define ETH_MAC_PMTCTLR_RTWKPT                         (0x07000000UL)
#define ETH_MAC_PMTCTLR_RTWKPT_0                       (0x01000000UL)
#define ETH_MAC_PMTCTLR_RTWKPT_1                       (0x02000000UL)
#define ETH_MAC_PMTCTLR_RTWKPT_2                       (0x04000000UL)
#define ETH_MAC_PMTCTLR_RTWKFR_POS                     (31U)
#define ETH_MAC_PMTCTLR_RTWKFR                         (0x80000000UL)

/*  Bit definition for ETH_MAC_INTSTSR register  */
#define ETH_MAC_INTSTSR_PMTIS_POS                      (3U)
#define ETH_MAC_INTSTSR_PMTIS                          (0x00000008UL)
#define ETH_MAC_INTSTSR_MMCIS_POS                      (4U)
#define ETH_MAC_INTSTSR_MMCIS                          (0x00000010UL)
#define ETH_MAC_INTSTSR_MMCRXIS_POS                    (5U)
#define ETH_MAC_INTSTSR_MMCRXIS                        (0x00000020UL)
#define ETH_MAC_INTSTSR_MMCTXIS_POS                    (6U)
#define ETH_MAC_INTSTSR_MMCTXIS                        (0x00000040UL)
#define ETH_MAC_INTSTSR_TSPIS_POS                      (9U)
#define ETH_MAC_INTSTSR_TSPIS                          (0x00000200UL)

/*  Bit definition for ETH_MAC_INTMSKR register  */
#define ETH_MAC_INTMSKR_PMTIM_POS                      (3U)
#define ETH_MAC_INTMSKR_PMTIM                          (0x00000008UL)
#define ETH_MAC_INTMSKR_TSPIM_POS                      (9U)
#define ETH_MAC_INTMSKR_TSPIM                          (0x00000200UL)

