MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F4A0RGTB/mcu.h
typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t STR;
    __IO uint32_t OSF;
    uint32_t RESERVED1[2];
    __IO uint32_t DGF;
    __IO uint32_t FUF;
    __IO uint32_t FEF;
    uint32_t RESERVED2[5];
    __IO uint32_t STT;
    uint32_t RESERVED3[6];
    __IO uint32_t FTF;
    __IO uint32_t TSF;
    uint32_t RESERVED4[2];
    __IO uint32_t DFRF;
    __IO uint32_t RSF;
    __IO uint32_t DTCOE;
    uint32_t RESERVED5[5];
} stc_eth_dma_oprmodr_bit_t;

typedef struct {
    __IO uint32_t TIE;
    __IO uint32_t TSE;
    __IO uint32_t TUE;
    __IO uint32_t TJE;
    __IO uint32_t OVE;
    __IO uint32_t UNE;
    __IO uint32_t RIE;
    __IO uint32_t RUE;
    __IO uint32_t RSE;
    __IO uint32_t RWE;
    __IO uint32_t ETE;
    uint32_t RESERVED0[2];
    __IO uint32_t FBE;
    __IO uint32_t ERE;
    __IO uint32_t AIE;
    __IO uint32_t NIE;
    uint32_t RESERVED1[15];
} stc_eth_dma_intenar_bit_t;

typedef struct {
    uint32_t RESERVED0[16];
    __I  uint32_t UNAOVF;
    uint32_t RESERVED1[11];
    __I  uint32_t OVFOVF;
    uint32_t RESERVED2[3];
} stc_eth_dma_rfrcntr_bit_t;

typedef struct {
    __IO uint32_t START;
    uint32_t RESERVED0[31];
} stc_fcm_str_bit_t;

typedef struct {
    uint32_t RESERVED0[7];
    __IO uint32_t INEXS;
    uint32_t RESERVED1[7];
    __IO uint32_t EXREFE;
    uint32_t RESERVED2[16];
} stc_fcm_rccr_bit_t;

typedef struct {
    __IO uint32_t ERRIE;
    __IO uint32_t MENDIE;
    __IO uint32_t OVFIE;
    uint32_t RESERVED0[1];
    __IO uint32_t ERRINTRS;
    uint32_t RESERVED1[2];
    __IO uint32_t ERRE;
    uint32_t RESERVED2[24];
} stc_fcm_rier_bit_t;

typedef struct {
    __I  uint32_t ERRF;
    __I  uint32_t MENDF;
    __I  uint32_t OVF;
    uint32_t RESERVED0[29];
} stc_fcm_sr_bit_t;

typedef struct {
    __O  uint32_t ERRFCLR;
    __O  uint32_t MENDFCLR;
    __O  uint32_t OVFCLR;
    uint32_t RESERVED0[29];
} stc_fcm_clr_bit_t;

typedef struct {
    __IO uint32_t FMACEN;
    uint32_t RESERVED0[31];
} stc_fmac_enr_bit_t;

typedef struct {
    __IO uint32_t INTEN;
    uint32_t RESERVED0[31];
} stc_fmac_ier_bit_t;

typedef struct {
    uint32_t RESERVED0[31];
    __IO uint32_t READY;
} stc_fmac_str_bit_t;

typedef struct {
    __I  uint32_t PIN00;
    __I  uint32_t PIN01;
    __I  uint32_t PIN02;
    __I  uint32_t PIN03;
    __I  uint32_t PIN04;
    __I  uint32_t PIN05;
    __I  uint32_t PIN06;
    __I  uint32_t PIN07;
    __I  uint32_t PIN08;
    __I  uint32_t PIN09;
    __I  uint32_t PIN10;
    __I  uint32_t PIN11;
    __I  uint32_t PIN12;
    __I  uint32_t PIN13;
    __I  uint32_t PIN14;
    __I  uint32_t PIN15;
} stc_gpio_pidr_bit_t;

typedef struct {
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    __IO uint32_t POUT02;
    __IO uint32_t POUT03;
    __IO uint32_t POUT04;
    __IO uint32_t POUT05;
    __IO uint32_t POUT06;
    __IO uint32_t POUT07;
    __IO uint32_t POUT08;
    __IO uint32_t POUT09;
    __IO uint32_t POUT10;
    __IO uint32_t POUT11;
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    __IO uint32_t POUT14;
    __IO uint32_t POUT15;
} stc_gpio_podr_bit_t;

typedef struct {
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    __IO uint32_t POUTE02;
    __IO uint32_t POUTE03;
    __IO uint32_t POUTE04;
    __IO uint32_t POUTE05;
    __IO uint32_t POUTE06;
    __IO uint32_t POUTE07;
    __IO uint32_t POUTE08;
    __IO uint32_t POUTE09;
    __IO uint32_t POUTE10;
    __IO uint32_t POUTE11;
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    __IO uint32_t POUTE14;
    __IO uint32_t POUTE15;
} stc_gpio_poer_bit_t;

typedef struct {
    __O  uint32_t POS00;
    __O  uint32_t POS01;
    __O  uint32_t POS02;
    __O  uint32_t POS03;
    __O  uint32_t POS04;
    __O  uint32_t POS05;
    __O  uint32_t POS06;
    __O  uint32_t POS07;
    __O  uint32_t POS08;
    __O  uint32_t POS09;
    __O  uint32_t POS10;
    __O  uint32_t POS11;
    __O  uint32_t POS12;
    __O  uint32_t POS13;
    __O  uint32_t POS14;
    __O  uint32_t POS15;
} stc_gpio_posr_bit_t;

typedef struct {
    __O  uint32_t POR00;
    __O  uint32_t POR01;
    __O  uint32_t POR02;
    __O  uint32_t POR03;
    __O  uint32_t POR04;
    __O  uint32_t POR05;
    __O  uint32_t POR06;
    __O  uint32_t POR07;
    __O  uint32_t POR08;
    __O  uint32_t POR09;
    __O  uint32_t POR10;
    __O  uint32_t POR11;
    __O  uint32_t POR12;
    __O  uint32_t POR13;
    __O  uint32_t POR14;
    __O  uint32_t POR15;
} stc_gpio_porr_bit_t;

typedef struct {
    __O  uint32_t POT00;
    __O  uint32_t POT01;
    __O  uint32_t POT02;
    __O  uint32_t POT03;
    __O  uint32_t POT04;
    __O  uint32_t POT05;
    __O  uint32_t POT06;
    __O  uint32_t POT07;
    __O  uint32_t POT08;
    __O  uint32_t POT09;
    __O  uint32_t POT10;
    __O  uint32_t POT11;
    __O  uint32_t POT12;
    __O  uint32_t POT13;
    __O  uint32_t POT14;
    __O  uint32_t POT15;
} stc_gpio_potr_bit_t;

typedef struct {
    __I  uint32_t PIN00;
    __I  uint32_t PIN01;
    uint32_t RESERVED0[14];
} stc_gpio_pidrh_bit_t;

typedef struct {
    __IO uint32_t POUT00;
    __IO uint32_t POUT01;
    uint32_t RESERVED0[14];
} stc_gpio_podrh_bit_t;

typedef struct {
    __IO uint32_t POUTE00;
    __IO uint32_t POUTE01;
    uint32_t RESERVED0[14];
} stc_gpio_poerh_bit_t;

typedef struct {
    __O  uint32_t POS00;
    __O  uint32_t POS01;
    uint32_t RESERVED0[14];
} stc_gpio_posrh_bit_t;

typedef struct {
    __O  uint32_t POR00;
    __O  uint32_t POR01;
    uint32_t RESERVED0[14];
} stc_gpio_porrh_bit_t;

typedef struct {
    __O  uint32_t POT00;
    __O  uint32_t POT01;
    uint32_t RESERVED0[14];
} stc_gpio_potrh_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __I  uint32_t PIN12;
    __I  uint32_t PIN13;
    uint32_t RESERVED1[2];
} stc_gpio_pidri_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __IO uint32_t POUT12;
    __IO uint32_t POUT13;
    uint32_t RESERVED1[2];
} stc_gpio_podri_bit_t;

typedef struct {
    uint32_t RESERVED0[12];
    __IO uint32_t POUTE12;
    __IO uint32_t POUTE13;
    uint32_t RESERVED1[2];
} stc_gpio_poeri_bit_t;

